In [1]:
import pandas as pd
import numpy as np
import matplotlib as plt
import pylab as pl
%pylab inline

Populating the interactive namespace from numpy and matplotlib

/Users/baileygriswold/anaconda3/lib/python3.6/site-packages/IPython/core/magics/pylab.py:160: UserWarning: pylab import has clobbered these variables: ['plt']
`%matplotlib` prevents importing * from pylab and numpy
  "\n`%matplotlib` prevents importing * from pylab and numpy"

In [2]:
schma = pd.read_csv('./schma_data/schma19962016.csv')
schma.head()

/Users/baileygriswold/anaconda3/lib/python3.6/site-packages/IPython/core/interactiveshell.py:2698: DtypeWarning: Columns (124,125,126,148,149,150,183,220,221,222,226,227,230,231,232,234,235,247) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

,DBN,SCHNAM,YEAR,SCHLEV,SCHLEV5,SCHS219962016,XDBN,XDBN_FLAG,ENRNUMPRK,ENRNUMKID,...,BNLONG_YRFIRST,BNLONG_YRLAST,BNLONG_TOTALYRS,BNLONG_PHASEDOUT19962016,BNLONG_PHASEDIN19962016,BNLONG_CONTOPERATE19962016,CBO,HSJHS,HSSCHSAMP2,SPECHS
0,00M801,HUNTER SCHOOL,1996,NaN,NaN,NaN,00M801,0,16,48,...,1996,1998,3.0,1,0,0,0,NaN,6,0
1,00M802,HUNTER SCHOOL,1996,NaN,NaN,NaN,00M802,0,0,0,...,1996,1998,3.0,1,0,0,0,1.0,6,0
2,00M803,HUNTER SCHOOL,1996,NaN,NaN,NaN,00M803,0,0,0,...,1996,1998,3.0,1,0,0,0,0.0,6,0
3,01M015,ROBERTO CLEMENTE,1996,NaN,NaN,NaN,01M015,0,0,36,...,1996,2016,21.0,0,0,0,0,NaN,6,0
4,01M019,ASHER LEVY,1996,NaN,NaN,NaN,01M019,0,33,82,...,1996,2016,21.0,0,0,0,0,NaN,6,0

In [3]:
schma['ENRNUMGEN'].value_counts().sort_index()

0       1239
1         18
2          3
3          2
7          1
10         1
14         1
15         1
17         2
18         2
19         2
20         1
21        10
22         8
23         4
24         9
25        10
26         5
27         6
28         8
29         4
30        11
31         7
32         5
33         6
34         9
35         7
36         9
37         5
38         6
        ...
4172       1
4216       1
4240       1
4262       1
4266       1
4291       1
4292       1
4296       2
4345       1
4412       1
4442       1
4456       1
4468       1
4469       1
4477       1
4519       1
4573       1
4614       1
4662       1
4678       1
4750       1
4853       1
4947       1
4957       1
5140       1
5332       1
5426       1
5451       1
5458       1
5512       1
Name: ENRNUMGEN, Length: 2699, dtype: int64

In [4]:
df_rnsch = pd.read_csv('./data/renewalSchools.csv')
df_rnsch.head()

      DBN                             SCHNAM_RENEW
0  18K566               Brooklyn Generation School
1  18K581  East Flatbush Community Research School
2  19K306                     P.S. 306 Ethan Allen
3  19K328                P.S. 328 Phyllis Wheatley
4  19K583                Multicultural High School

In [5]:
df_ = pd.merge(schma[['DBN', 'SCHNAM', 'BNLONG', 'BN']], df_rnsch, on='DBN', how='left')

In [6]:
len(df_[~df_.duplicated(subset=['DBN', 'BNLONG', 'BN'])])

2145

In [7]:
df_.head()

      DBN            SCHNAM BNLONG    BN SCHNAM_RENEW
0  00M801     HUNTER SCHOOL   M801  M801          NaN
1  00M802     HUNTER SCHOOL   M802  M802          NaN
2  00M803     HUNTER SCHOOL   M803  M803          NaN
3  01M015  ROBERTO CLEMENTE   M015  M015          NaN
4  01M019        ASHER LEVY   M019  M019          NaN

In [8]:
df_ = df_[~df_.duplicated(subset=['BNLONG'])]

In [9]:
len(df_['SCHNAM_RENEW'])

2000

In [10]:
len(df_['SCHNAM_RENEW']) - df_['SCHNAM_RENEW'].isnull().sum()

24

In [11]:
df_.loc[~df_.SCHNAM_RENEW.isnull(), 'RenewlSchl'] = int(1)

In [12]:
df_.loc[df_.SCHNAM_RENEW.isnull(), 'RenewlSchl'] = int(0)

In [13]:
df_[df_.SCHNAM == 'LONG ISLAND CITY HIGH SCHOOL']

,DBN,SCHNAM,BNLONG,BN,SCHNAM_RENEW,RenewlSchl
931,30Q450,LONG ISLAND CITY HIGH SCHOOL,Q450,Q450,Long Island City High School,1.0

In [14]:
df_.isnull().sum()

DBN                0
SCHNAM            26
BNLONG             1
BN                 0
SCHNAM_RENEW    1976
RenewlSchl         0
dtype: int64

*** Add in Commmunity Schools ***

In [15]:
comm = pd.read_excel('./schma_data/NYC-Community-Schools.xlsx', header=2)

In [16]:
comm['Community_Sch'] = int(1)

In [17]:
comm.rename(columns={'Year Started': 'Comm_Start_yr'}, inplace=True)

In [18]:
comm.head()

,DBN,School Name,Grade,Lead CBO,Comm_Start_yr,Community_Sch
0,01M015,P.S. 015 Roberto Clemente,Elementary,Pathways to Leadership,2014-2015,1
1,01M064,P.S. 064 Robert Simon,Elementary,Educational Alliance,2017-2018,1
2,01M142,P.S. 142 Amalia Castro,Elementary,Educational Alliance,2017-2018,1
3,01M188,P.S. 188 The Island School,K-8,Educational Alliance,2014-2015,1
4,01M292,Orchard Collegiate Academy,High school,Henry Street Settlement,2015-2016,1

In [19]:
len(comm)

227

In [20]:
comm.DBN = [s.strip(' ') for s in comm.DBN]

In [21]:
df_.head()

      DBN            SCHNAM BNLONG    BN SCHNAM_RENEW  RenewlSchl
0  00M801     HUNTER SCHOOL   M801  M801          NaN         0.0
1  00M802     HUNTER SCHOOL   M802  M802          NaN         0.0
2  00M803     HUNTER SCHOOL   M803  M803          NaN         0.0
3  01M015  ROBERTO CLEMENTE   M015  M015          NaN         0.0
4  01M019        ASHER LEVY   M019  M019          NaN         0.0

In [22]:
print (len(df_))
print (len(comm))
len(pd.merge(df_, comm, on='DBN', how='inner'))

2000
227

217

There are 11 community schools not in the schma data?

In [23]:
df_ = pd.merge(df_, comm, on='DBN', how='left')

In [24]:
comm_sch = [s.upper() for s in comm.DBN.unique() if s not in df_.DBN.unique()]

In [25]:
for x in [x[2:] for x in comm_sch]:
    print (x)

X584
X297
X324
X412
X061
X271
K404
K583
Q540
M522

In [26]:
for x in [x[2:] for x in comm_sch]:
    df_.loc[df_.BN == x, 'Community_Sch'] = 1

In [27]:
for x in [x[2:] for x in comm_sch]:
    print (df_[df_.BN == x])

Empty DataFrame
Columns: [DBN, SCHNAM, BNLONG, BN, SCHNAM_RENEW, RenewlSchl, School Name, Grade , Lead CBO, Comm_Start_yr, Community_Sch]
Index: []
         DBN SCHNAM BNLONG    BN SCHNAM_RENEW  RenewlSchl School Name Grade   \
1498  12X297    NaN   X297  X297          NaN         0.0         NaN    NaN

     Lead CBO Comm_Start_yr  Community_Sch
1498      NaN           NaN            1.0
         DBN SCHNAM BNLONG    BN SCHNAM_RENEW  RenewlSchl School Name Grade   \
1613  10X324    NaN   X324  X324          NaN         0.0         NaN    NaN

     Lead CBO Comm_Start_yr  Community_Sch
1613      NaN           NaN            1.0
         DBN SCHNAM BNLONG    BN SCHNAM_RENEW  RenewlSchl School Name Grade   \
1331  10X412    NaN   X412  X412          NaN         0.0         NaN    NaN

     Lead CBO Comm_Start_yr  Community_Sch
1331      NaN           NaN            1.0
        DBN                      SCHNAM BNLONG    BN SCHNAM_RENEW  RenewlSchl  \
370  12X061  FRANCISCO OLLER - P.S. #61   X061  X061          NaN         0.0

    School Name Grade  Lead CBO Comm_Start_yr  Community_Sch
370         NaN    NaN      NaN           NaN            1.0
         DBN                          SCHNAM BNLONG    BN SCHNAM_RENEW  \
1489  11X271  EAST BRONX ACADEMY FOR THE FUT   X271  X271          NaN

      RenewlSchl School Name Grade  Lead CBO Comm_Start_yr  Community_Sch
1489         0.0         NaN    NaN      NaN           NaN            1.0
         DBN SCHNAM BNLONG    BN SCHNAM_RENEW  RenewlSchl School Name Grade   \
1621  14K404    NaN   K404  K404          NaN         0.0         NaN    NaN

     Lead CBO Comm_Start_yr  Community_Sch
1621      NaN           NaN            1.0
         DBN                     SCHNAM BNLONG    BN SCHNAM_RENEW  RenewlSchl  \
1667  14K583  MULTICULTURAL HIGH SCHOOL   K583  K583          NaN         0.0

     School Name Grade  Lead CBO Comm_Start_yr  Community_Sch
1667         NaN    NaN      NaN           NaN            1.0
         DBN                      SCHNAM BNLONG    BN SCHNAM_RENEW  \
1417  79Q540  QUEENS ACADEMY HIGH SCHOOL   Q540  Q540          NaN

      RenewlSchl School Name Grade  Lead CBO Comm_Start_yr  Community_Sch
1417         0.0         NaN    NaN      NaN           NaN            1.0
Empty DataFrame
Columns: [DBN, SCHNAM, BNLONG, BN, SCHNAM_RENEW, RenewlSchl, School Name, Grade , Lead CBO, Comm_Start_yr, Community_Sch]
Index: []

In [28]:
df_.Community_Sch = df_.Community_Sch.fillna(0)

*** Add in closed schools ***

In [29]:
closed = pd.read_csv('./data/ClosedSchools.csv')
closed.drop(['Unnamed: 0'], axis=1, inplace=True)
closed.head()

  BNLONG  MaxYear_x  MaxYear_y  Percentage  MaxYear
0   M635        163        163         1.0     2013
1   K027        153        153         1.0     2011
2   K332        140        140         1.0     2014
3   Q225        140        140         1.0     2011
4   X156        139        139         1.0     2008

In [30]:
closed.columns = ['BNLONG', 'MaxYear_x_cls', 'MaxYear_y_cls', 'Percentage', 'MaxYear_cls']

In [31]:
closed['Closed'] = 1

In [32]:
closed.columns

Index(['BNLONG', 'MaxYear_x_cls', 'MaxYear_y_cls', 'Percentage', 'MaxYear_cls',
       'Closed'],
      dtype='object')

In [33]:
closed.drop(['MaxYear_x_cls', 'MaxYear_y_cls', 'Percentage'], axis=1, inplace=True)

In [34]:
print (len(df_))
print (len(closed))
len(pd.merge(df_, closed, on='BNLONG', how='inner'))

2000
314

314

In [35]:
df_ = pd.merge(df_, closed, on='BNLONG', how='left')

*** add in the school type ***

In [36]:
len(df_)

2000

In [37]:
len(schma)

30345

In [38]:
sch_tmp = schma.sort_values(['BNLONG','LCGSCHCAT', 'LCGSCHTYP'])[['BNLONG','LCGSCHCAT', 'LCGSCHTYP', 'HSSCHSAMP2']]

In [39]:
sch_tmp = sch_tmp[~sch_tmp[['BNLONG']].duplicated()]

In [40]:
df_ = pd.merge(df_, sch_tmp, on='BNLONG', how='left')

In [41]:
df_.head()

,DBN,SCHNAM,BNLONG,BN,SCHNAM_RENEW,RenewlSchl,School Name,Grade,Lead CBO,Comm_Start_yr,Community_Sch,MaxYear_cls,Closed,LCGSCHCAT,LCGSCHTYP,HSSCHSAMP2
0,00M801,HUNTER SCHOOL,M801,M801,NaN,0.0,NaN,NaN,NaN,NaN,0.0,NaN,NaN,NaN,NaN,6
1,00M802,HUNTER SCHOOL,M802,M802,NaN,0.0,NaN,NaN,NaN,NaN,0.0,NaN,NaN,NaN,NaN,6
2,00M803,HUNTER SCHOOL,M803,M803,NaN,0.0,NaN,NaN,NaN,NaN,0.0,NaN,NaN,NaN,NaN,6
3,01M015,ROBERTO CLEMENTE,M015,M015,NaN,0.0,P.S. 015 Roberto Clemente,Elementary,Pathways to Leadership,2014-2015,1.0,NaN,NaN,ELEMENTARY,GENERAL ACADEMIC,7
4,01M019,ASHER LEVY,M019,M019,NaN,0.0,NaN,NaN,NaN,NaN,0.0,NaN,NaN,ELEMENTARY,GENERAL ACADEMIC,7

In [42]:
len(df_)

2000

In [43]:
len(df_.BNLONG.unique())

2000

In [44]:
df_[df_.duplicated(['BNLONG'], keep=False)].sort_values(['BNLONG'])

Empty DataFrame
Columns: [DBN, SCHNAM, BNLONG, BN, SCHNAM_RENEW, RenewlSchl, School Name, Grade , Lead CBO, Comm_Start_yr, Community_Sch, MaxYear_cls, Closed, LCGSCHCAT, LCGSCHTYP, HSSCHSAMP2]
Index: []

*** Merge DBN, SCHNAM, BNLONG, BN, and SCHNAM_RENEW onto SCHMELTS ***

schmelt05-16.csv  
schmelt09-16.csv  
schmelt11-15.csv  
schmelt13-16.csv  
schmelt96-16.csv

In [45]:
schmelts = ['schmelt05-16.csv', 'schmelt09-16.csv', 'schmelt11-15.csv', 
            'schmelt13-16.csv', 'schmelt96-16.csv']

In [46]:
clust = pd.read_csv('./schma_data/clusterAssignments.csv')
clust.drop(['Unnamed: 0'], axis=1, inplace=True)

In [47]:
for cv in schmelts:
    dfsch = pd.read_csv('./schma_data/{}'.format(cv))
    df_tmp = pd.merge(dfsch, df_, on='BNLONG', how='left')
    df_tmp = pd.merge(df_tmp, clust, on='BNLONG', how='left')
    df_tmp.to_csv('./schma_data/{}'.format(cv), index=False)